:PROPERTIES:
:ID:       efe37cba-a1c4-4269-bd11-59f335dacf79
:END:
#+TITLE: Python: Setting up Emacs-Jupyter with Pyenv and Scimax
#+CATEGORY: slips
#+TAGS:
#+PROPERTY: header-args:jupyter-python  :session jupyter-python-14afe3b01826c65b7c27210f8c35bc66


#+begin_src emacs-lisp
(setq-local org-babel-default-header-args:jupyter-python
      '((:results . "both")
	      (:session . "jupyter-python")
	      ;; (:kernel . "python3")
	      (:pandoc . "t")
	      ;; (:exports . "both")
	      (:cache .   "no")
	      (:noweb . "no")
	      (:hlines . "no")
	      (:tangle . "no")
	      (:eval . "never-export")))
#+end_src

#+RESULTS:
: ((:results . both) (:session . jupyter-python) (:pandoc . t) (:cache . no) (:noweb . no) (:hlines . no) (:tangle . no) (:eval . never-export))

* Docs

+ [[https://ipython.readthedocs.io/en/stable/config/options/kernel.html][ipykernel options]]


* Notes

** Pyenv Setup

Create the direnv files necessary to create a new =pyenv venv= under...

Then in the new =venv=, run:

#+begin_src sh
pip install ipykernel numpy
python -m ipykernel install --user --name="emacs-ipykernel"
#+end_src


** Babel Setup



** Misc

*** Opening new blocks

Starts to open the block, but doesn't actually open it.

Shows =Need a valid session and a kernel to form a key=

* Notebook

You need to start a session before opening or running blocks

#+BEGIN_SRC jupyter-python
import os
os.environ['PATH']
#+END_SRC

#+RESULTS:
: /data/lang/.pyenv/versions/3.10.11/envs/emacs-ipykernel-3.10.11/bin:/gnu/store/4wrzjr7zvrx78bkzmv3gp5k5qjryy1ip-profile/bin:/gnu/store/4wrzjr7zvrx78bkzmv3gp5k5qjryy1ip-profile/sbin:/flatpak/matlab/R2022a/bin:/home/dc/.config/guix/current/bin:/home/dc/.guix-extra-profiles/academic/academic/bin:/home/dc/.guix-extra-profiles/arch-pwsafe/arch-pwsafe/bin:/home/dc/.nix-profile/bin:/data/lang/.pyenv/shims:/data/lang/.pyenv/bin:/home/dc/.npm-global/bin:/home/dc/.local/bin:/home/dc/.bin:/home/dc/.nix-profile/bin:/nix/var/nix/profiles/default/bin:/home/dc/.guix-profile/bin:/home/dc/.config/guix/current/bin:/usr/local/sbin:/usr/local/bin:/usr/bin:/usr/lib/jvm/default/bin:/opt/rocm-5.6.1/bin:/opt/rocm-5.6.1/hip/bin:/usr/bin/site_perl:/usr/bin/vendor_perl:/usr/bin/core_perl:/gnu/store/78rf44kf4xf6lc01jjy9ci5905j2344l-gzip-1.12/bin:/gnu/store/yr39rh6wihd1wv6gzf7w4w687dwzf3vb-coreutils-9.1/bin


** IPython Kernel Introspection

The =get_ipython()= function returns a =ZMQInteractiveShell=

#+BEGIN_SRC jupyter-python
ipyk = get_ipython()
#+END_SRC
